# Mini Project - SQL
###### Author: Ashley Jiangyang

### Work with SQL-based databases and Python.

This project serves as a demonstration of how to use Jupyter notebook to set up a connection   to the local database and query the data.
<br /><br />
- Raw data files were accessed from the Springboard's online SQL platform.
- The Local database was built in MySQL server with the name of "country_club".
- This database contains 3 tables:
  - Bookings
  - Facilities
  - Members

In [2]:
# Import Packages
from sqlalchemy import create_engine
import pymysql
import pandas as pd

In [3]:
# Create Engine to connect local Mysql Database
engine = create_engine('mysql+pymysql://root:Ashley0127@127.0.0.1:3306/country_club')

In [4]:
# Preview Table from Country_club Database
table_names = engine.table_names()
print(table_names)

['Bookings', 'Facilities', 'Members']

In [5]:
# Q1: Some of the facilities charge a fee to members, but some do not.
# Please list the names of the facilities that do. 

sql_1 = """
    SELECT name 
    FROM Facilities 
    WHERE membercost > 0
    """
charge_fcs = pd.read_sql_query(sql_1, engine)
print('The facilities charge a fee to members: \n' , charge_fcs)

The facilities charge a fee to members:
              name
0  Tennis Court 1
1  Tennis Court 2
2  Massage Room 1
3  Massage Room 2
4    Squash Court

In [6]:
# Q2: How many facilities do not charge a fee to members? 

sql_2 = """
    SELECT COUNT(DISTINCT name) as Number 
    FROM Facilities 
    WHERE membercost = 0
    """
numbers_no_charge = pd.read_sql_query(sql_2 , engine)
print('Number of facilities do not charge a fee to members: \n', numbers_no_charge )

Number of facilities do not charge a fee to members:
    Number
0       4

In [7]:
# Q3: How can you produce a list of facilities that charge a fee to members,
# where the fee is less than 20% of the facility's monthly maintenance cost?
# Return the facid, facility name, member cost, and monthly maintenance of the
# facilities in question.

sql_3 = """
    SELECT facid, name, membercost, monthlymaintenance 
    FROM Facilities 
    WHERE membercost < 0.2*monthlymaintenance AND membercost !=0
"""
less_20_matain__fcs = pd.read_sql_query(sql_3, engine)
print('Facilities charge a fee less than 20% of monthly maintenance cost : \n', less_20_matain__fcs)

Facilities charge a fee less than 20% of monthly maintenance cost :
    facid            name  membercost  monthlymaintenance
0      0  Tennis Court 1         5.0                 200
1      1  Tennis Court 2         5.0                 200
2      4  Massage Room 1         9.9                3000
3      5  Massage Room 2         9.9                3000
4      6    Squash Court         3.5                  80

In [8]:
# Q4: How can you retrieve the details of facilities with ID 1 and 5?
# Write the query without using the OR operator.

sql_4 = """
     SELECT * 
     FROM Facilities 
     WHERE facid in (1,5)
"""
ID_1to5_fcs = pd.read_sql_query(sql_4, engine)
print('Facilities with ID 1 and 5: \n', ID_1to5_fcs)

Facilities with ID 1 and 5:
    facid            name  membercost  guestcost  initialoutlay  \
0      1  Tennis Court 2         5.0       25.0           8000
1      5  Massage Room 2         9.9       80.0           4000

   monthlymaintenance
0                 200
1                3000

In [9]:
# Q5: How can you produce a list of facilities, with each labelled as
# 'cheap' or 'expensive', depending on if their monthly maintenance cost is
# more than $100? Return the name and monthly maintenance of the facilities
# in question. 

sql_5 = """
   SELECT name, 
          monthlymaintenance, 
          CASE WHEN monthlymaintenance < 100 THEN "cheap" 
               ELSE "expensive" END AS label 
FROM Facilities
"""
label_fcs = pd.read_sql_query(sql_5, engine)
print('Facility label based on Monthly maintenance cost: \n', label_fcs)

Facility label based on Monthly maintenance cost:
               name  monthlymaintenance      label
0   Tennis Court 1                 200  expensive
1   Tennis Court 2                 200  expensive
2  Badminton Court                  50      cheap
3     Table Tennis                  10      cheap
4   Massage Room 1                3000  expensive
5   Massage Room 2                3000  expensive
6     Squash Court                  80      cheap
7    Snooker Table                  15      cheap
8       Pool Table                  15      cheap

In [10]:
# Q6: You'd like to get the first and last name of the last member(s)
# who signed up. Do not use the LIMIT clause for your solution. 

sql_6 = """
    SELECT firstname, surname, joindate 
    FROM Members 
    WHERE joindate IN (SELECT max(joindate) FROM Members)
"""
last_signup_mbs = pd.read_sql_query(sql_6, engine)
print('last member(s) who signed up: \n', last_signup_mbs)

last member(s) who signed up:
   firstname surname             joindate
0    Darren   Smith  2012-09-26 18:08:45

In [11]:
# Q7: How can you produce a list of all members who have used a tennis court?
# Include in your output the name of the court, and the name of the member
# formatted as a single column. Ensure no duplicate data, and order by
# the member name. 

sql_7 = """
    SELECT DISTINCT F.name as court_name, 
           CONCAT(M.firstname," ", M.surname) AS member_name 
    FROM Bookings AS B 
    INNER JOIN (SELECT facid, name FROM Facilities WHERE name LIKE "%%Tennis%%Court%%") AS F 
    ON B.facid  =  F.facid 
    LEFT JOIN Members AS M 
    ON B.memid = M.memid
    ORDER BY 2
"""
mebs_ten_ct = pd.read_sql_query(sql_7, engine)
print('members who have used a tennis court:\n', mebs_ten_ct)

members who have used a tennis court:
         court_name        member_name
0   Tennis Court 1         Anne Baker
1   Tennis Court 2         Anne Baker
2   Tennis Court 2       Burton Tracy
3   Tennis Court 1       Burton Tracy
4   Tennis Court 1       Charles Owen
5   Tennis Court 2       Charles Owen
6   Tennis Court 2       Darren Smith
7   Tennis Court 2      David Farrell
8   Tennis Court 1      David Farrell
9   Tennis Court 1        David Jones
10  Tennis Court 2        David Jones
11  Tennis Court 1       David Pinker
12  Tennis Court 1      Douglas Jones
13  Tennis Court 1      Erica Crumpet
14  Tennis Court 1     Florence Bader
15  Tennis Court 2     Florence Bader
16  Tennis Court 2     Gerald Butters
17  Tennis Court 1     Gerald Butters
18  Tennis Court 2        GUEST GUEST
19  Tennis Court 1        GUEST GUEST
20  Tennis Court 2   Henrietta Rumney
21  Tennis Court 2         Jack Smith
22  Tennis Court 1         Jack Smith
23  Tennis Court 2    Janice Joplette
24  Tennis Court 1    Janice Joplette
25  Tennis Court 1     Jemima Farrell
26  Tennis Court 2     Jemima Farrell
27  Tennis Court 1        Joan Coplin
28  Tennis Court 1          John Hunt
29  Tennis Court 2          John Hunt
30  Tennis Court 1    Matthew Genting
31  Tennis Court 2  Millicent Purview
32  Tennis Court 2         Nancy Dare
33  Tennis Court 1         Nancy Dare
34  Tennis Court 2    Ponder Stibbons
35  Tennis Court 1    Ponder Stibbons
36  Tennis Court 1   Ramnaresh Sarwin
37  Tennis Court 2   Ramnaresh Sarwin
38  Tennis Court 1         Tim Boothe
39  Tennis Court 2         Tim Boothe
40  Tennis Court 2         Tim Rownam
41  Tennis Court 1         Tim Rownam
42  Tennis Court 2      Timothy Baker
43  Tennis Court 1      Timothy Baker
44  Tennis Court 1        Tracy Smith
45  Tennis Court 2        Tracy Smith

In [12]:
# Q8: How can you produce a list of bookings on the day of 2012-09-14 which
# will cost the member (or guest) more than $30? Remember that guests have
# different costs to members (the listed costs are per half-hour 'slot'), and
# the guest user's ID is always 0. Include in your output the name of the
# facility, the name of the member formatted as a single column, and the cost.
# Order by descending cost, and do not use any subqueries. 

sql_8 = """
SELECT F.name AS facility_name, 
       CONCAT(M.firstname," ", M.surname) AS member_name, 
       CASE WHEN B.memid = 0 THEN F.guestcost*B.slots*2
            ELSE F.membercost*B.slots*2 END AS cost 
FROM Bookings AS B 
LEFT JOIN Facilities AS F 
ON B.facid = F.facid 
LEFT JOIN Members as M 
ON B.memid = M.memid 
WHERE (starttime >= "2012-09-14" AND starttime < "2012-09-15") 
      AND (CASE WHEN B.memid = 0 THEN F.guestcost*B.slots*2
            ELSE F.membercost*B.slots*2 END) > 30
ORDER BY 3 DESC
"""
cost_on_914_A = pd.read_sql_query(sql_8, engine)
print('bookings that more than $30 on the day of 2012-09-14: \n' ,cost_on_914_A)

bookings that more than $30 on the day of 2012-09-14:
      facility_name      member_name   cost
0   Massage Room 2      GUEST GUEST  640.0
1   Massage Room 1      GUEST GUEST  320.0
2   Massage Room 1      GUEST GUEST  320.0
3   Massage Room 1      GUEST GUEST  320.0
4   Tennis Court 2      GUEST GUEST  300.0
5   Tennis Court 1      GUEST GUEST  150.0
6   Tennis Court 1      GUEST GUEST  150.0
7   Tennis Court 2      GUEST GUEST  150.0
8     Squash Court      GUEST GUEST  140.0
9   Massage Room 1   Jemima Farrell   79.2
10    Squash Court      GUEST GUEST   70.0
11    Squash Court      GUEST GUEST   70.0
12  Tennis Court 2      David Jones   60.0
13  Tennis Court 2       Tim Boothe   60.0
14  Massage Room 1     Burton Tracy   39.6
15  Massage Room 1       Jack Smith   39.6
16  Massage Room 1  Matthew Genting   39.6
17  Massage Room 2   Florence Bader   39.6
18  Massage Room 1   Jemima Farrell   39.6
19  Massage Room 1  Ponder Stibbons   39.6

In [13]:
# Q9: This time, produce the same result as in Q8, but using a subquery. 

sql_9 = """
SELECT sub.facility_name, sub.member_name, sub.cost
FROM(SELECT F.name AS facility_name, 
            CONCAT(M.firstname," ", M.surname) AS member_name, 
            CASE WHEN B.memid = 0 THEN F.guestcost*B.slots*2 
                 ELSE F.membercost*B.slots*2 END AS cost 
     FROM(SELECT * FROM Bookings WHERE (starttime >= "2012-09-14" AND starttime < "2012-09-15")) AS B 
          LEFT JOIN Facilities AS F 
          ON B.facid  =  F.facid 
     LEFT JOIN Members as M 
     ON B.memid = M.memid) AS sub 
WHERE sub.cost > 30 
ORDER BY sub.cost DESC
"""
cost_on_914_B = pd.read_sql_query(sql_9, engine)
print('bookings on the day of 2012-09-14: \n' ,cost_on_914_B)

bookings on the day of 2012-09-14:
      facility_name      member_name   cost
0   Massage Room 2      GUEST GUEST  640.0
1   Massage Room 1      GUEST GUEST  320.0
2   Massage Room 1      GUEST GUEST  320.0
3   Massage Room 1      GUEST GUEST  320.0
4   Tennis Court 2      GUEST GUEST  300.0
5   Tennis Court 1      GUEST GUEST  150.0
6   Tennis Court 1      GUEST GUEST  150.0
7   Tennis Court 2      GUEST GUEST  150.0
8     Squash Court      GUEST GUEST  140.0
9   Massage Room 1   Jemima Farrell   79.2
10    Squash Court      GUEST GUEST   70.0
11    Squash Court      GUEST GUEST   70.0
12  Tennis Court 2      David Jones   60.0
13  Tennis Court 2       Tim Boothe   60.0
14  Massage Room 1     Burton Tracy   39.6
15  Massage Room 1       Jack Smith   39.6
16  Massage Room 1  Matthew Genting   39.6
17  Massage Room 2   Florence Bader   39.6
18  Massage Room 1   Jemima Farrell   39.6
19  Massage Room 1  Ponder Stibbons   39.6

In [15]:
# Q10: Produce a list of facilities with a total revenue less than 1000.
# The output of facility name and total revenue, sorted by revenue. Remember
# that there's a different cost for guests and members! 

sql_10 = """
SELECT sub.facility_name,
       sub.total_revenue
FROM (SELECT F.name AS facility_name,
             SUM(CASE WHEN M.memid = 0 THEN F.guestcost*B.total_hrs*2 
                    ELSE F.membercost*B.total_hrs*2 END) AS total_revenue
     FROM(SELECT facid, memid, SUM(slots) AS total_hrs
          FROM Bookings
          GROUP By 1, 2) AS B
     LEFT JOIN Facilities AS F 
     ON B.facid  =  F.facid 
     LEFT JOIN Members as M 
     ON B.memid = M.memid
     GROUP BY 1) AS sub
WHERE sub.total_revenue < 1000
ORDER BY sub.total_revenue 
"""
total_rev_less_1K =  pd.read_sql_query(sql_10, engine)
print('facilities with a total revenue less than 1000.: \n', total_rev_less_1K)

facilities with a total revenue less than 1000.:
    facility_name  total_revenue
0   Table Tennis          360.0
1  Snooker Table          480.0
2     Pool Table          540.0